def get(char_id):
    return {
        "shape": char_id,
        "photo": char_id,

        "名字": "猴精",
        "召唤兽名": "猴精",

        "等级": 0,
        "转生": 0,

        "成长率": 1.173,
        "初始气血": 108,
        "初始法力": 0,
        "初始攻击": 168,
        "初始速度": 42,
        "技能": [],
    
        "潜力": 0,

        "气血": 80,
        "最大气血": 100,
        "根骨": 0,

        "法力": 50,
        "最大法力": 100,
        "灵性": 0,

        "攻击": 200,
        "力量": 0,

        "速度": 200,
        "敏捷": 0,

        "经验": 1800,

        "金": 0,
        "木": 0,
        "水": 0,
        "火": 0,
        "土": 0
    }