# from tinydb import TinyDB, Query
# import tinydb_encrypted_jsonstorage as tae
# KEY = "hello"
# PATH = "D:/.encrypted_db"
# db = TinyDB(encryption_key=KEY, path=PATH, storage=tae.EncryptedJSONStorage)


# Fruit = Query()
# db.update({'count': 10000}, Fruit.type == 'apple')

# db.remove(Fruit.count > 5)
# print(db.all())

# from lib import pyfmodex
# from lib.pyfmodex.flags import MODE
# from lib.pyfmodex.structures import CREATESOUNDEXINFO
# from core.res_manager import res_manager



# system = pyfmodex.System()

# system.init()

# item = res_manager.get("sound.wdf", "0x4F8F2281")



# sound = system.create_sound(item.data,
#                             mode=MODE.OPENMEMORY | MODE.LOOP_OFF,
#                             exinfo=CREATESOUNDEXINFO(length=item.size))

# channel = sound.play()

# import time

# time.sleep(1)

# channel = sound.play()

# time.sleep(100)
from slpp import slpp as lua
code = """{
[1] = { 名称 = '逍遥生', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [2] = { 名称 = '剑侠客', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [3] = { 名称 = '猛壮士', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [4] = { 名称 = '俏千金', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [5] = { 名称 = '飞燕女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [6] = { 名称 = '英女侠', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    --魔
    [7] = { 名称 = '巨魔王', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [8] = { 名称 = '夺命妖', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [9] = { 名称 = '虎头怪', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [10] = { 名称 = '狐美人', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [11] = { 名称 = '骨精灵', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [12] = { 名称 = '小蛮妖', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    --仙
    [13] = { 名称 = '神天兵', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [14] = { 名称 = '龙战将', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [15] = { 名称 = '智圣仙', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [16] = { 名称 = '舞天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [17] = { 名称 = '精灵仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [18] = { 名称 = '玄剑娥', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    --鬼+6
    [60] = { 名称 = '猎魂引', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [61] = { 名称 = '无崖子', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [62] = { 名称 = '剑祭魂', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [63] = { 名称 = '夜灵溪', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    [64] = { 名称 = '幽梦影', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    [65] = { 名称 = '墨衣行', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    ----1转
    [40] = { 名称 = '飞剑侠', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [41] = { 名称 = '燕山雪', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [42] = { 名称 = '逆天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [43] = { 名称 = '媚灵狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [44] = { 名称 = '武尊神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [45] = { 名称 = '玄天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    ---2转
    [50] = { 名称 = '纯阳子', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [51] = { 名称 = '红拂女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [52] = { 名称 = '混天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [53] = { 名称 = '九尾狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [54] = { 名称 = '紫薇神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [55] = { 名称 = '霓裳仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } }
}"""

print(lua.decode(code))