characters = {
    1: {'名称': '逍遥生', '性别': 1, '种族': 1, '门派': ['程府', '化生寺', '方寸山'], "武器": {"扇": 1, "剑": 19}, "描述": "一袭白衫，一把铁扇或一柄长剑，凭此三物而走遍江湖。与一般武夫不同的是，他们在快意恩仇之余，也喜欢舞文弄墨。"}, 
    2: {'名称': '剑侠客', '性别': 1, '种族': 1, '门派': ['程府', '化生寺', '方寸山'], "武器": {"剑": 2, "锤": 20}, "描述": "潇洒倜傥，风度不凡。或手执长剑，或手握双锤，锄强扶弱，直指世间一切不平事。儿女情，英雄意，都付笑谈中。"}, 
    3: {'名称': '猛壮士', '性别': 1, '种族': 1, '门派': ['程府', '化生寺', '方寸山'], "武器": {"拳套": 3, "斧": 21}, "描述": "猛壮士擅使双斧和拳套。他曾说过，习武不是为了彰显自身或是求取功名，而是为了伸张正义，保护那些需要自己保护的人。"}, 
    4: {'名称': '俏千金', '性别': 2, '种族': 1, '门派': ['方寸山', '女儿村', '程府'], "武器": {"刀": 4, "枪": 22}, "描述": "俏千金从小跟着家中的武师习武，学得一手好刀法和好枪法。每到舞刀弄枪之时，轻灵跃动，犹如燕子穿梭，姿势十分好看。"}, 
    5: {'名称': '飞燕女', '性别': 2, '种族': 1, '门派': ['方寸山', '女儿村', '程府'], "武器": {"钩": 5, "鞭": 23}, "描述": "从小被异人带进深山修炼武艺，爱用钩和鞭子，喜欢大自然，身轻如燕，生性自然跳脱，活泼可爱，是个天生的乐观派。"}, 
    6: {'名称': '英女侠', '性别': 2, '种族': 1, '门派': ['方寸山', '女儿村', '程府'], "武器": {"刀": 6, "棍": 24}, "描述": "名士之女，贤淑端庄，有着一股与生俱来的浩然正气。擅使短刀或棍杖，有爱心，路见不平必拔刀相助，是个巾帼不让须眉的女侠。"}, 

    7: {'名称': '巨魔王', '性别': 1, '种族': 2, '门派': ['狮驼岭', '地府', '魔王寨'], "武器": {"刀": 7, "枪": 25}, "描述": "魔族之子，以庞大的身形及天生的神力而著称。钟情的武器是大刀和枪矛，挥舞起来虎虎有声，令对手不战而退。"}, 
    8: {'名称': '夺命妖', '性别': 1, '种族': 2, '门派': ['狮驼岭', '地府', '魔王寨'], "武器": {"刀": 8, "幡": 26}, "描述": "有阴间“夺命杀手”之称。不喜欢硬打硬拼，刀走偏锋，专攻对手弱点；还有独门武器招魂幡，夺命勾魂，实是厉害非常。"}, 
    9: {'名称': '虎头怪', '性别': 1, '种族': 2, '门派': ['狮驼岭', '地府', '魔王寨'], "武器": {"棍": 9, "枪": 27}, "描述": "足智多谋，力量与智慧的结合体。他们并不一味地依赖于与生俱来的魔族之力，而是尽可能多地拓展自己的潜能。拿手武器是棍杖和枪矛。"}, 
    10: {'名称': '狐美人', '性别': 2, '种族': 2, '门派': ['盘丝洞', '地府', '魔王寨'], "武器": {"爪": 10, "鞭": 28}, "描述": "天生对动物有着特别的感情，爱与动物为伴；驯有一妖狐，使得一手好鞭法，好胜心强，喜欢追求各种刺激和挑战。"}, 
    11: {'名称': '骨精灵', '性别': 2, '种族': 2, '门派': ['盘丝洞', '地府', '魔王寨'], "武器": {"棍": 11, "剑": 29}, "描述": "由不死白骨吸取天地养分多年所化而成的妖精，对世间的许多事物都抱有一颗好奇之心。爱好和平，但受侵犯时也会以棍杖或短剑来出击自卫。"}, 
    12: {'名称': '小蛮妖', '性别': 2, '种族': 2, '门派': ['盘丝洞', '地府', '魔王寨'], "武器": {"钩": 12, "刀": 30}, "描述": "刁蛮任性，性感泼辣，红色头饰和带刺的护腕使之显得与众不同。擅使单刀，刀法干脆利落；还有一对双钩，挥动起来也是得心应手。"}, 

    13: {'名称': '神天兵', '性别': 1, '种族': 3, '门派': ['天宫', '五庄观', '龙宫'], "武器": {"枪": 13, "锤": 31}, "描述": "昔日殷商守城将，一身殉国千古闻，玉帝感其刚烈，特拔擢为南天王座下天兵，性刚直，势威猛，气韵不凡。"}, 
    14: {'名称': '龙战将', '性别': 1, '种族': 3, '门派': ['天宫', '五庄观', '龙宫'], "武器": {"棍": 14, "爪": 32}, "描述": "身经百战的天界战将，不怒自威。一支舞得出神入化的棍杖和一对无坚不摧的利爪均是所向披靡，让不少的敌人闻风丧胆。"}, 
    15: {'名称': '智圣仙', '性别': 1, '种族': 3, '门派': ['天宫', '五庄观', '龙宫'], "武器": {"拂尘": 15, "剑": 33}, "描述": "修道多年的神仙，以一把随身携带、伤人于无形的拂尘和利剑为除敌的武器。最可怕还是他们睿智的头脑，不轻易为敌人的挑衅所动。"}, 
    16: {'名称': '舞天姬', '性别': 2, '种族': 3, '门派': ['天宫', '普陀山', '龙宫'], "武器": {"飘带": 16, "棍": 34}, "描述": "美貌、优雅而高贵，讲究穿着和打扮。攻击时使用长棍或彩带，看似无力，但经她们的手施出时却让人不可轻视。"}, 
    17: {'名称': '精灵仙', '性别': 2, '种族': 3, '门派': ['天宫', '普陀山', '龙宫'], "武器": {"刀": 17, "拳套": 35}, "描述": "精灵调皮，爱恶作剧和开些善意的玩笑。性格好动，因圆刀的外形可爱而选择了它作为防身武器，又因孩子气而喜欢上了拳套。"}, 
    18: {'名称': '玄剑娥', '性别': 2, '种族': 3, '门派': ['天宫', '普陀山', '龙宫'], "武器": {"枪": 18, "剑": 36}, "描述": "神将之后，是一位高贵但不失亲和力的女仙。平时她温婉柔和，而在战斗的时候，她则招招为制敌取胜，颇有大将之风。"}, 

    60: {'名称': '猎魂引', '性别': 1, '种族': 4, '门派': ['白骨洞', '阴都', '三尸派'], "武器": {"枪": 60, "拳套": 66}, "描述": ""}, 
    61: {'名称': '无崖子', '性别': 1, '种族': 4, '门派': ['白骨洞', '阴都', '三尸派'], "武器": {"书": 61, "幡": 67}, "描述": ""}, 
    62: {'名称': '剑祭魂', '性别': 1, '种族': 4, '门派': ['白骨洞', '阴都', '三尸派'], "武器": {"刀": 62, "剑": 68}, "描述": ""}, 
    63: {'名称': '夜灵溪', '性别': 2, '种族': 4, '门派': ['白骨洞', '阴都', '兰若寺'], "武器": {"灯笼": 63, "双环": 69}, "描述": ""}, 
    64: {'名称': '幽梦影', '性别': 2, '种族': 4, '门派': ['白骨洞', '阴都', '兰若寺'], "武器": {"飘带": 64, "双环": 70}, "描述": ""}, 
    65: {'名称': '墨衣行', '性别': 2, '种族': 4, '门派': ['白骨洞', '阴都', '兰若寺'], "武器": {"鞭": 65, "钩": 71}, "描述": ""}, 

    40: {'名称': '飞剑侠', '性别': 1, '种族': 1, '门派': ['程府', '化生寺', '方寸山']}, 
    41: {'名称': '燕山雪', '性别': 2, '种族': 1, '门派': ['方寸山', '女儿村', '程府']}, 
    42: {'名称': '逆天魔', '性别': 1, '种族': 2, '门派': ['狮驼岭', '地府', '魔王寨']}, 
    43: {'名称': '媚灵狐', '性别': 2, '种族': 2, '门派': ['盘丝洞', '地府', '魔王寨']}, 
    44: {'名称': '武尊神', '性别': 1, '种族': 3, '门派': ['天宫', '五庄观', '龙宫']}, 
    45: {'名称': '玄天姬', '性别': 2, '种族': 3, '门派': ['天宫', '普陀山', '龙宫']}, 
    
    50: {'名称': '纯阳子', '性别': 1, '种族': 1, '门派': ['程府', '化生寺', '方寸山']}, 
    51: {'名称': '红拂女', '性别': 2, '种族': 1, '门派': ['方寸山', '女儿村', '程府']}, 
    52: {'名称': '混天魔', '性别': 1, '种族': 2, '门派': ['狮驼岭', '地府', '魔王寨']}, 
    53: {'名称': '九尾狐', '性别': 2, '种族': 2, '门派': ['盘丝洞', '地府', '魔王寨']}, 
    54: {'名称': '紫薇神', '性别': 1, '种族': 3, '门派': ['天宫', '五庄观', '龙宫']}, 
    55: {'名称': '霓裳仙', '性别': 2, '种族': 3, '门派': ['天宫', '普陀山', '龙宫']}
}

种族 = {
    1: "人", 2: "魔", 3: "仙", 4: "鬼"
}

性别 = {
    1: "男", 2: "女"
}